try:
    num2, num1 = input("Введите два любых числа через пробел: ").split()  # считываем строку и сразу делим на две части (причем меняем местами)
    num1 = int(num1)  # переводим первую переменную в целое число
    num2 = int(num2)  # переводим вторую переменную в целое число
    print(num1, "\n", num2)  # выводим их друг под другом (уже в обратном порядке из-за первой строчки)
    
    total_sum = num1 + num2  # складываем числа (назвали total_sum, чтобы не перебивать встроенную функцию sum)
    print("Результат:", total_sum)
except ValueError:
    print("Ввод не корректен! Вводите только целые числа.")  # сработает, если юзер ввел буквы или символы вместо чисел